print('Шефратор мамка приветствует.')
symbols = {' ':'0000','\n':'0001','a':'0002','A':'0003','b':'0003','B':'0004','c':'0005','C':'0006','d':'0007','D':'0008','e':'0009','E':'0010','f':'0011','F':'0012','g':'0013','G':'0014','h':'0015','H':'0016','i':'0017','I':'0018','j':'0019','J':'0020','k':'0021','K':'0022','l':'0023','L':'0024','m':'00025','M':'0026','n':'0027','N':'0028','o':'0028','O':'0029','p':'0030','P':'0031','q':'0032','Q':'0033','r':'0034','R':'0035','s':'0036','S':'0037','t':'0038','T':'0039','u':'0040','U':'0041','v':'0042','V':'0043','w':'0044','W':'0045','x':'0046','X':'0047','y':'0048','Y':'0049','z':'0050','Z':'0051'}
file = input('Введите путь к файлу сохронений и чтения.\t')
do = input('Выберите действие "читать" или "записывать"')
if do == 'записывать':
    print('Вводите текст для записи, для выхода введите "\\\\\\E"')
    with open(file,'+w') as writer:
        while True:
            write = input()
            if write == '\\\\\\E':
                break
            writer.write(write)